{
    "personal_information": {},
    "education": [
        "• SRM Institute of Science and Technology",
        "B.Tech in Computer Science and Artificial Intelligence - CGPA: 9.05/10",
        "• MODERN Public School",
        "Class XII - Percentage: 85.50%",
        "• MODERN Public School",
        "Class X - Percentage: 87.16%"
    ],
    "work_experience": [],
    "skills": [
        "• Programming Languages: C++, Python , C , JavaScript",
        "• Web Development: HTML ,CSS,Tailwind CSS,React",
        "• Database Management: MySql",
        "• Platforms:VScode, Anaconda Navigator,Git/Github",
        "• Academic Coursework:Data Structures and Algorithms, OOPS, DBMS, Operating System"
    ],
    "projects": [
        "• Task Management :  | TailWindCSS,JavaScript , React",
        "◦ Developed a task management application using React, JavaScript, and Tailwind CSS, enabling dynamic task",
        "creation, assignment, and priority categorization.",
        "◦ Implemented robust task assignment and priority categorization features, utilizing useState to manage task",
        "states and useEffect for seamless data fetching and updates, resulting in improved task management efficiency",
        "and team collaboration.",
        "• Nexus Application :  | HTML,CSS,JavaScript,TypeScript",
        "◦ Spearheaded the creation of Nexus App, a remote team collaboration platform, employing TypeScript, HTML,",
        "CSS, and Next.js.",
        "◦ Orchestrated the integration of authentication mechanisms and successfully deployed the application on Vercel,",
        "optimizing performance and user accessibility.",
        "• Price prediction Model:  | Jupyter Notebook , Scikit , Python",
        "◦ Developed a house price prediction model using Scikit-learn and Jupyter Notebook, leveraging Python’s data",
        "science libraries for data preprocessing and model evaluation.",
        "◦",
        "Implemented a Random Forest regressor algorithm to accurately compute house prices based on key features,",
        "enhancing decision-making in real estate valuation."
    ],
    "achievements": [
        "Uttar Pradesh",
        "2021 - 2025",
        "Bhiwadi, Rajasthan",
        "2021",
        "Bhiwadi , Rajasthan",
        "2019",
        "• Hackathon: Participated in HackInnovate held at SRMIST and got selected for final round",
        "May 2024",
        "• Youth Excite Day: Bagged 1st runner up position in Group Dance competition and won a cash prize of Rs 7000",
        "Aug 2023"
    ],
    "positions_of_responsibility": [
        "• MAGAN, SRMIST Delhi | Oct 2022 - March 2024",
        "◦ Organized and managed various music events during my college years, including concerts, talent shows, and",
        "musical workshops. Successfully coordinated logistics, collaborated with performers and sponsors, and ensured",
        "seamless execution, contributing to vibrant campus culture and entertainment"
    ],
    "soft_skills": []
}